Klipper3d/klipper/lib/asf/sam/utils/cmsis/samg/samg53/include/component/component_twihs.h
#define TWIHS_TPR_TXPTR_Msk (0xffffffffu << TWIHS_TPR_TXPTR_Pos) /**< \brief (TWIHS_TPR) Transmit Counter Register */
#define TWIHS_TPR_TXPTR(value) ((TWIHS_TPR_TXPTR_Msk & ((value) << TWIHS_TPR_TXPTR_Pos)))
/* -------- TWIHS_TCR : (TWIHS Offset: 0x10C) Transmit Counter Register -------- */
#define TWIHS_TCR_TXCTR_Pos 0
#define TWIHS_TCR_TXCTR_Msk (0xffffu << TWIHS_TCR_TXCTR_Pos) /**< \brief (TWIHS_TCR) Transmit Counter Register */
#define TWIHS_TCR_TXCTR(value) ((TWIHS_TCR_TXCTR_Msk & ((value) << TWIHS_TCR_TXCTR_Pos)))
/* -------- TWIHS_RNPR : (TWIHS Offset: 0x110) Receive Next Pointer Register -------- */
#define TWIHS_RNPR_RXNPTR_Pos 0
#define TWIHS_RNPR_RXNPTR_Msk (0xffffffffu << TWIHS_RNPR_RXNPTR_Pos) /**< \brief (TWIHS_RNPR) Receive Next Pointer */
#define TWIHS_RNPR_RXNPTR(value) ((TWIHS_RNPR_RXNPTR_Msk & ((value) << TWIHS_RNPR_RXNPTR_Pos)))
/* -------- TWIHS_RNCR : (TWIHS Offset: 0x114) Receive Next Counter Register -------- */
#define TWIHS_RNCR_RXNCTR_Pos 0
#define TWIHS_RNCR_RXNCTR_Msk (0xffffu << TWIHS_RNCR_RXNCTR_Pos) /**< \brief (TWIHS_RNCR) Receive Next Counter */
#define TWIHS_RNCR_RXNCTR(value) ((TWIHS_RNCR_RXNCTR_Msk & ((value) << TWIHS_RNCR_RXNCTR_Pos)))
/* -------- TWIHS_TNPR : (TWIHS Offset: 0x118) Transmit Next Pointer Register -------- */
#define TWIHS_TNPR_TXNPTR_Pos 0
#define TWIHS_TNPR_TXNPTR_Msk (0xffffffffu << TWIHS_TNPR_TXNPTR_Pos) /**< \brief (TWIHS_TNPR) Transmit Next Pointer */
#define TWIHS_TNPR_TXNPTR(value) ((TWIHS_TNPR_TXNPTR_Msk & ((value) << TWIHS_TNPR_TXNPTR_Pos)))
/* -------- TWIHS_TNCR : (TWIHS Offset: 0x11C) Transmit Next Counter Register -------- */
#define TWIHS_TNCR_TXNCTR_Pos 0
#define TWIHS_TNCR_TXNCTR_Msk (0xffffu << TWIHS_TNCR_TXNCTR_Pos) /**< \brief (TWIHS_TNCR) Transmit Counter Next */
#define TWIHS_TNCR_TXNCTR(value) ((TWIHS_TNCR_TXNCTR_Msk & ((value) << TWIHS_TNCR_TXNCTR_Pos)))
/* -------- TWIHS_PTCR : (TWIHS Offset: 0x120) Transfer Control Register -------- */
#define TWIHS_PTCR_RXTEN (0x1u << 0) /**< \brief (TWIHS_PTCR) Receiver Transfer Enable */
#define TWIHS_PTCR_RXTDIS (0x1u << 1) /**< \brief (TWIHS_PTCR) Receiver Transfer Disable */
#define TWIHS_PTCR_TXTEN (0x1u << 8) /**< \brief (TWIHS_PTCR) Transmitter Transfer Enable */
#define TWIHS_PTCR_TXTDIS (0x1u << 9) /**< \brief (TWIHS_PTCR) Transmitter Transfer Disable */
#define TWIHS_PTCR_RXCBEN (0x1u << 16) /**< \brief (TWIHS_PTCR) Receiver Circular Buffer Enable */
#define TWIHS_PTCR_RXCBDIS (0x1u << 17) /**< \brief (TWIHS_PTCR) Receiver Circular Buffer Disable */
#define TWIHS_PTCR_TXCBEN (0x1u << 18) /**< \brief (TWIHS_PTCR) Transmitter Circular Buffer Enable */
#define TWIHS_PTCR_TXCBDIS (0x1u << 19) /**< \brief (TWIHS_PTCR) Transmitter Circular Buffer Disable */
#define TWIHS_PTCR_ERRCLR (0x1u << 24) /**< \brief (TWIHS_PTCR) Transfer Bus Error Clear */
/* -------- TWIHS_PTSR : (TWIHS Offset: 0x124) Transfer Status Register -------- */
#define TWIHS_PTSR_RXTEN (0x1u << 0) /**< \brief (TWIHS_PTSR) Receiver Transfer Enable */
#define TWIHS_PTSR_TXTEN (0x1u << 8) /**< \brief (TWIHS_PTSR) Transmitter Transfer Enable */
#define TWIHS_PTSR_RXCBEN (0x1u << 16) /**< \brief (TWIHS_PTSR) Receiver Transfer Enable */
#define TWIHS_PTSR_TXCBEN (0x1u << 18) /**< \brief (TWIHS_PTSR) Transmitter Transfer Enable */
#define TWIHS_PTSR_ERR (0x1u << 24) /**< \brief (TWIHS_PTSR) Transfer Bus Error */

/*@}*/


#endif /* _SAMG53_TWIHS_COMPONENT_ */
